---
kind: type
id: T:Autodesk.Revit.DB.PartUtils
source: html/a7384ccf-cd2b-9080-38d3-58b1253cd8e4.htm
---
# Autodesk.Revit.DB.PartUtils

General Part utility methods

## Syntax (C#)
```csharp
public static class PartUtils
```